module.exports = [
    {
        title: "数据结构-基础",
        collapsable: false,
        sidebarDepth: 0,
        children: [
            ['数据结构概述', '数据结构概述'],
            ['时间复杂度与空间复杂度', '时间复杂度与空间复杂度'],
            ['字符串和数组', '字符串和数组'],
            ['链表', '链表'],
            ['队列', '队列'],
            ['树', '树']
        ]
    },
    {
        title: "算法",
        collapsable: false,
        sidebarDepth: 0,
        children: [
            ['算法题常见名词解释', '算法题常见名词解释'],
            ['位运算技巧总结', '位运算技巧总结'],
            ['算法解题技巧总结', '算法解题技巧总结'],
            ['如何轻而易举的写出递归函数', '如何轻而易举的写出递归函数'],
            ['深度优先和广度优先', '深度优先和广度优先']
        ]
    },
    {
        title: "排序",
        collapsable: false,
        sidebarDepth: 0,
        children: [
            ["./sort/排序算法总结", '排序算法总结'],
            ["./sort/插入排序", '插入排序']
        ]
    }
];